JyenZhou/UN-MCU/JQStart/23.4.14/LIB/HAL/MM32/Manufacturer/reg_core.h
/**
  * @brief NVIC_PRI10 Register Bit Definition
  */
#define NVIC_IPR7_PRI_40                (0x000000FFU)                           /*!< Priority of interrupt 40 */
#define NVIC_IPR7_PRI_41                (0x0000FF00U)                           /*!< Priority of interrupt 41 */
#define NVIC_IPR7_PRI_42                (0x00FF0000U)                           /*!< Priority of interrupt 42 */
#define NVIC_IPR7_PRI_43                (0xFF000000U)                           /*!< Priority of interrupt 43 */

/**
  * @brief NVIC_PRI11 Register Bit Definition
  */
#define NVIC_IPR7_PRI_44                (0x000000FFU)                           /*!< Priority of interrupt 44 */
#define NVIC_IPR7_PRI_45                (0x0000FF00U)                           /*!< Priority of interrupt 45 */
#define NVIC_IPR7_PRI_46                (0x00FF0000U)                           /*!< Priority of interrupt 46 */
#define NVIC_IPR7_PRI_47                (0xFF000000U)                           /*!< Priority of interrupt 47 */

/**
  * @brief SCB_CPUID Register Bit Definition
  */
#define SCB_CPUID_REVISION              (0x0000000FU)                           /*!< Implementation defined revision number */
#define SCB_CPUID_PARTNO                (0x0000FFF0U)                           /*!< Number of processor within family */
#define SCB_CPUID_Constant              (0x000F0000U)                           /*!< Reads as 0x0F */
#define SCB_CPUID_VARIANT               (0x00F00000U)                           /*!< Implementation defined variant number */
#define SCB_CPUID_IMPLEMENTER           (0xFF000000U)                           /*!< Implementer code. ARM is 0x41 */

/**
  * @brief SCB_ICSR Register Bit Definition
  */
#define SCB_ICSR_VECTACTIVE             (0x000001FFU)                           /*!< Active ISR number field */
#define SCB_ICSR_RETTOBASE              (0x00000800U)                           /*!< All active exceptions minus the IPSR_current_exception yields the empty set */
#define SCB_ICSR_VECTPENDING            (0x003FF000U)                           /*!< Pending ISR number field */
#define SCB_ICSR_ISRPENDING             (0x00400000U)                           /*!< Interrupt pending flag */
#define SCB_ICSR_ISRPREEMPT             (0x00800000U)                           /*!< It indicates that a pending interrupt becomes active in the next running cycle */
#define SCB_ICSR_PENDSTCLR              (0x02000000U)                           /*!< Clear pending SysTick bit */
#define SCB_ICSR_PENDSTSET              (0x04000000U)                           /*!< Set pending SysTick bit */
#define SCB_ICSR_PENDSVCLR              (0x08000000U)                           /*!< Clear pending pendSV bit */
#define SCB_ICSR_PENDSVSET              (0x10000000U)                           /*!< Set pending pendSV bit */
#define SCB_ICSR_NMIPENDSET             (0x80000000U)                           /*!< Set pending NMI bit */

/**
  * @brief SCB_VTOR Register Bit Definition
  */
#define SCB_VTOR_TBLOFF                 (0x1FFFFF80U)                           /*!< Vector table base offset field */
#define SCB_VTOR_TBLBASE                (0x20000000U)                           /*!< Table base in code(0) or RAM(1) */

/**
  * @brief SCB_AIRCR Register Bit Definition
  */
#define SCB_AIRCR_VECTRESET             (0x00000001U)                           /*!< System Reset bit */
#define SCB_AIRCR_VECTCLRACTIVE         (0x00000002U)                           /*!< Clear active vector bit */
#define SCB_AIRCR_SYSRESETREQ           (0x00000004U)                           /*!< Requests chip control logic to generate a reset */
#define SCB_AIRCR_PRIGROUP              (0x00000700U)                           /*!< PRIGROUP[2:0] bits (Priority group) */
#define SCB_AIRCR_PRIGROUP_0            (0x00000100U)                           /*!< Bit 0 */
#define SCB_AIRCR_PRIGROUP_1            (0x00000200U)                           /*!< Bit 1 */
#define SCB_AIRCR_PRIGROUP_2            (0x00000400U)                           /*!< Bit 2 */

#define SCB_AIRCR_PRIGROUP0             (0x00000000U)                           /*!< Priority group=0 (7 bits of pre-emption priority, 1 bit of subpriority) */
#define SCB_AIRCR_PRIGROUP1             (0x00000100U)                           /*!< Priority group=1 (6 bits of pre-emption priority, 2 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP2             (0x00000200U)                           /*!< Priority group=2 (5 bits of pre-emption priority, 3 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP3             (0x00000300U)                           /*!< Priority group=3 (4 bits of pre-emption priority, 4 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP4             (0x00000400U)                           /*!< Priority group=4 (3 bits of pre-emption priority, 5 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP5             (0x00000500U)                           /*!< Priority group=5 (2 bits of pre-emption priority, 6 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP6             (0x00000600U)                           /*!< Priority group=6 (1 bit of pre-emption priority, 7 bits of subpriority) */
#define SCB_AIRCR_PRIGROUP7             (0x00000700U)                           /*!< Priority group=7 (no pre-emption priority, 8 bits of subpriority) */

#define SCB_AIRCR_ENDIANESS             (0x00008000U)                           /*!< Data endianness bit */
#define SCB_AIRCR_VECTKEY               (0xFFFF0000U)                           /*!< Register key (VECTKEY) - Reads as 0xFA05 (VECTKEYSTAT) */

/**
  * @brief SCB_SCR Register Bit Definition
  */
#define SCB_SCR_SLEEPONEXIT             (0x02U)                                 /*!< Sleep on exit bit */
#define SCB_SCR_SLEEPDEEP               (0x04U)                                 /*!< Sleep deep bit */
#define SCB_SCR_SEVONPEND               (0x10U)                                 /*!< Wake up from WFE */

/**
  * @brief SCB_CCR Register Bit Definition
  */
#define SCB_CCR_NONBASETHRDENA          (0x0001U)                               /*!< Thread mode can be entered from any level in Handler mode by controlled return value */
#define SCB_CCR_USERSETMPEND            (0x0002U)                               /*!< Enables user code to write the Software Trigger Interrupt register to trigger (pend) a Main exception */
#define SCB_CCR_UNALIGN_TRP             (0x0008U)                               /*!< Trap for unaligned access */
#define SCB_CCR_DIV_0_TRP               (0x0010U)                               /*!< Trap on Divide by 0 */
#define SCB_CCR_BFHFNMIGN               (0x0100U)                               /*!< Handlers running at priority -1 and -2 */
#define SCB_CCR_STKALIGN                (0x0200U)                               /*!< On exception entry, the SP used prior to the exception is adjusted to be 8-byte aligned */

/**
  * @brief SCB_SHPR Register Bit Definition
  */
#define SCB_SHPR_PRI_N                  (0x000000FFU)                           /*!< Priority of system handler 4,8, and 12. Mem Manage, reserved and Debug Monitor */
#define SCB_SHPR_PRI_N1                 (0x0000FF00U)                           /*!< Priority of system handler 5,9, and 13. Bus Fault, reserved and reserved */
#define SCB_SHPR_PRI_N2                 (0x00FF0000U)                           /*!< Priority of system handler 6,10, and 14. Usage Fault, reserved and PendSV */
#define SCB_SHPR_PRI_N3                 (0xFF000000U)                           /*!< Priority of system handler 7,11, and 15. Reserved, SVCall and SysTick */

/**
  * @brief SCB_SHCSR Register Bit Definition
  */
#define SCB_SHCSR_MEMFAULTACT           (0x00000001U)                           /*!< MemManage is active */
#define SCB_SHCSR_BUSFAULTACT           (0x00000002U)                           /*!< BusFault is active */
#define SCB_SHCSR_USGFAULTACT           (0x00000008U)                           /*!< UsageFault is active */
#define SCB_SHCSR_SVCALLACT             (0x00000080U)                           /*!< SVCall is active */
#define SCB_SHCSR_MONITORACT            (0x00000100U)                           /*!< Monitor is active */
#define SCB_SHCSR_PENDSVACT             (0x00000400U)                           /*!< PendSV is active */
#define SCB_SHCSR_SYSTICKACT            (0x00000800U)                           /*!< SysTick is active */
#define SCB_SHCSR_USGFAULTPENDED        (0x00001000U)                           /*!< Usage Fault is pended */
#define SCB_SHCSR_MEMFAULTPENDED        (0x00002000U)                           /*!< MemManage is pended */
#define SCB_SHCSR_BUSFAULTPENDED        (0x00004000U)                           /*!< Bus Fault is pended */
#define SCB_SHCSR_SVCALLPENDED          (0x00008000U)                           /*!< SVCall is pended */
#define SCB_SHCSR_MEMFAULTENA           (0x00010000U)                           /*!< MemManage enable */
#define SCB_SHCSR_BUSFAULTENA           (0x00020000U)                           /*!< Bus Fault enable */
#define SCB_SHCSR_USGFAULTENA           (0x00040000U)                           /*!< UsageFault enable */

/**
  * @brief SCB_CFSR Register Bit Definition
  */
/*!< MFSR */
#define SCB_CFSR_IACCVIOL               (0x00000001U)                           /*!< Instruction access violation */
#define SCB_CFSR_DACCVIOL               (0x00000002U)                           /*!< Data access violation */
#define SCB_CFSR_MUNSTKERR              (0x00000008U)                           /*!< Unstacking error */
#define SCB_CFSR_MSTKERR                (0x00000010U)                           /*!< Stacking error */
#define SCB_CFSR_MMARVALID              (0x00000080U)                           /*!< Memory Manage Address Register address valid flag */
/*!< BFSR */
#define SCB_CFSR_IBUSERR                (0x00000100U)                           /*!< Instruction bus error flag */
#define SCB_CFSR_PRECISERR              (0x00000200U)                           /*!< Precise data bus error */
#define SCB_CFSR_IMPRECISERR            (0x00000400U)                           /*!< Imprecise data bus error */
#define SCB_CFSR_UNSTKERR               (0x00000800U)                           /*!< Unstacking error */
#define SCB_CFSR_STKERR                 (0x00001000U)                           /*!< Stacking error */
#define SCB_CFSR_BFARVALID              (0x00008000U)                           /*!< Bus Fault Address Register address valid flag */
/*!< UFSR */
#define SCB_CFSR_UNDEFINSTR             (0x00010000U)                           /*!< The processor attempt to excecute an undefined instruction */
#define SCB_CFSR_INVSTATE               (0x00020000U)                           /*!< Invalid combination of EPSR and instruction */
#define SCB_CFSR_INVPC                  (0x00040000U)                           /*!< Attempt to load EXC_RETURN into pc illegally */
#define SCB_CFSR_NOCP                   (0x00080000U)                           /*!< Attempt to use a coprocessor instruction */
#define SCB_CFSR_UNALIGNED              (0x01000000U)                           /*!< Fault occurs when there is an attempt to make an unaligned memory access */
#define SCB_CFSR_DIVBYZERO              (0x02000000U)                           /*!< Fault occurs when SDIV or DIV instruction is used with a divisor of 0 */

/**
  * @brief SCB_HFSR Register Bit Definition
  */
#define SCB_HFSR_VECTTBL                (0x00000002U)                           /*!< Fault occures because of vector table read on exception processing */
#define SCB_HFSR_FORCED                 (0x40000000U)                           /*!< Hard Fault activated when a configurable Fault was received and cannot activate */
#define SCB_HFSR_DEBUGEVT               (0x80000000U)                           /*!< Fault related to debug */

/**
  * @brief SCB_DFSR Register Bit Definition
  */
#define SCB_DFSR_HALTED                 (0x01U)                                 /*!< Halt request flag */
#define SCB_DFSR_BKPT                   (0x02U)                                 /*!< BKPT flag */
#define SCB_DFSR_DWTTRAP                (0x04U)                                 /*!< Data Watchpoint and Trace (DWT) flag */
#define SCB_DFSR_VCATCH                 (0x08U)                                 /*!< Vector catch flag */
#define SCB_DFSR_EXTERNAL               (0x10U)                                 /*!< External debug request flag */

/**
  * @brief SCB_MMFAR Register Bit Definition
  */
#define SCB_MMFAR_ADDRESS               (0xFFFFFFFFU)                           /*!< Mem Manage fault address field */

/**
  * @brief SCB_BFAR Register Bit Definition
  */
#define SCB_BFAR_ADDRESS                (0xFFFFFFFFU)                           /*!< Bus fault address field */

/**
  * @brief SCB_AFSR Register Bit Definition
  */
#define SCB_AFSR_IMPDEF                 (0xFFFFFFFFU)                           /*!< Implementation defined */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/
